In [1]:
import pandas as pd

In [2]:
pip install pandas

Requirement already satisfied: pandas in /opt/conda/lib/python3.10/site-packages (1.5.2)
Requirement already satisfied: python-dateutil>=2.8.1 in /opt/conda/lib/python3.10/site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in /opt/conda/lib/python3.10/site-packages (from pandas) (2022.6)
Requirement already satisfied: numpy>=1.21.0 in /opt/conda/lib/python3.10/site-packages (from pandas) (1.23.5)
Requirement already satisfied: six>=1.5 in /opt/conda/lib/python3.10/site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [3]:
pd.read_csv('da.csv')

   Id       name  Age  Gender
0   4      Alice   25  Female
1   8        Bob   30    Male
2  15     Claire   27  Female
3  16       sudh   24    male
4  23      rohri   21    male
5  42     sartaj   22    male
6  30      shivs   23    male
7  45  raghunath   40    male
8  56     Ahilya   39  Female
9  60       bhai   20    male

In [ ]:
Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [5]:
data =pd.read_csv('da.csv')

In [7]:
 data

   Id       name  Age  Gender
0   4      Alice   25  Female
1   8        Bob   30    Male
2  15     Claire   27  Female
3  16       sudh   24    male
4  23      rohri   21    male
5  42     sartaj   22    male
6  30      shivs   23    male
7  45  raghunath   40    male
8  56     Ahilya   39  Female
9  60       bhai   20    male

In [12]:
data.head(6)

   Id    name  Age  Gender
0   4   Alice   25  Female
1   8     Bob   30    Male
2  15  Claire   27  Female
3  16    sudh   24    male
4  23   rohri   21    male
5  42  sartaj   22    male

In [18]:
data['Id']

0     4
1     8
2    15
3    16
4    23
5    42
6    30
7    45
8    56
9    60
Name: Id, dtype: int64

In [14]:
daa =(data['Id'])

In [16]:
daa.head(6)

0     4
1     8
2    15
3    16
4    23
5    42
Name: Id, dtype: int64

In [19]:
type(daa)

pandas.core.series.Series

In [ ]:
Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it.

In [20]:
pd.read_csv('da.csv')

   Id       name  Age  Gender
0   4      Alice   25  Female
1   8        Bob   30    Male
2  15     Claire   27  Female
3  16       sudh   24    male
4  23      rohri   21    male
5  42     sartaj   22    male
6  30      shivs   23    male
7  45  raghunath   40    male
8  56     Ahilya   39  Female
9  60       bhai   20    male

In [21]:
b =pd.read_csv('da.csv')

In [26]:
b['name']

0        Alice
1          Bob
2       Claire
3         sudh
4        rohri
5       sartaj
6        shivs
7    raghunath
8       Ahilya
9         bhai
Name: name, dtype: object

In [31]:
list(b['name'])

['Alice',
 'Bob',
 'Claire',
 'sudh',
 'rohri',
 'sartaj',
 'shivs',
 'raghunath',
 'Ahilya',
 'bhai']

In [30]:
type(b['name'])

pandas.core.series.Series

In [ ]:
Q3. Create a Pandas DataFrame that contains the following data:
    
Name                  Age            Gender

Alice                 25             Female
Bob                   30             Male
Claire                25             Female
   
Then, print the DataFrame.

In [32]:
pd.read_csv('da.csv')

   Id       name  Age  Gender
0   4      Alice   25  Female
1   8        Bob   30    Male
2  15     Claire   27  Female
3  16       sudh   24    male
4  23      rohri   21    male
5  42     sartaj   22    male
6  30      shivs   23    male
7  45  raghunath   40    male
8  56     Ahilya   39  Female
9  60       bhai   20    male

In [33]:
daa= pd.read_csv('da.csv')

In [36]:
daa[['name','Age','Gender']]

        name  Age  Gender
0      Alice   25  Female
1        Bob   30    Male
2     Claire   27  Female
3       sudh   24    male
4      rohri   21    male
5     sartaj   22    male
6      shivs   23    male
7  raghunath   40    male
8     Ahilya   39  Female
9       bhai   20    male

In [37]:
dss=daa[['name','Age','Gender']]

In [38]:
dss

        name  Age  Gender
0      Alice   25  Female
1        Bob   30    Male
2     Claire   27  Female
3       sudh   24    male
4      rohri   21    male
5     sartaj   22    male
6      shivs   23    male
7  raghunath   40    male
8     Ahilya   39  Female
9       bhai   20    male

In [41]:
dss.head(3)

     name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [42]:
type(daa)

pandas.core.frame.DataFrame

In [ ]:
Q7. Create a DataFrame using multiple Series. Explain with an example.

In [4]:
import pandas as pd

In [5]:
pip install pandas

Requirement already satisfied: pandas in /opt/conda/lib/python3.10/site-packages (1.5.2)
Requirement already satisfied: python-dateutil>=2.8.1 in /opt/conda/lib/python3.10/site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in /opt/conda/lib/python3.10/site-packages (from pandas) (2022.6)
Requirement already satisfied: numpy>=1.21.0 in /opt/conda/lib/python3.10/site-packages (from pandas) (1.23.5)
Requirement already satisfied: six>=1.5 in /opt/conda/lib/python3.10/site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [6]:
d= {'Id':[ 88,71,42,15,772295],
    'Name':['sudhir','bhai','rohit','jani','nirman',],
     'phon_number':[111,222,333,444,555],
      'Addres':['dulahara','tendhukheda','pura','nidor','usa']




}

In [11]:
aa = pd.DataFrame(d)

In [12]:
Type(aa)

       Id    Name  phon_number       Addres
0      88  sudhir          111     dulahara
1      71    bhai          222  tendhukheda
2      42   rohit          333         pura
3      15    jani          444        nidor
4  772295  nirman          555          usa

In [14]:
type(aa)

pandas.core.frame.DataFrame

In [15]:
aa = pd.Series(d)

In [16]:
aa

Id                              [88, 71, 42, 15, 772295]
Name                 [sudhir, bhai, rohit, jani, nirman]
phon_number                    [111, 222, 333, 444, 555]
Addres         [dulahara, tendhukheda, pura, nidor, usa]
dtype: object

In [17]:
dd= {'Id':( 88,71,42,15,772295),
    'Name':('sudhir','bhai','rohit','jani','nirman'),
     'phon_number':(111,222,333,444,555),
      'Addres':('dulahara','tendhukheda','pura','nidor','usa')




}

In [18]:
aaa =pd.Series(dd)

In [19]:
aaa

Id                              (88, 71, 42, 15, 772295)
Name                 (sudhir, bhai, rohit, jani, nirman)
phon_number                    (111, 222, 333, 444, 555)
Addres         (dulahara, tendhukheda, pura, nidor, usa)
dtype: object

In [20]:
type(aaa)

pandas.core.series.Series

In [ ]:
Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

In [ ]:
Pandas Dataframe -
                    A Pandas DataFrame is a 2 dimensional data structure, like a 2 dimensional array, or a table with rows and columns.

In [40]:
d= {'Id':[ 88,71,42,15,772295],
    'Name':['sudhir','bhai','rohit','jani','nirman',],
     'phon_number':[111,222,333,444,555],
      'Addres':['dulahara','tendhukheda','pura','nidor','usa']




}

In [41]:
pd.DataFrame(d)

       Id    Name  phon_number       Addres
0      88  sudhir          111     dulahara
1      71    bhai          222  tendhukheda
2      42   rohit          333         pura
3      15    jani          444        nidor
4  772295  nirman          555          usa

In [ ]:
pandas.series-
              A Pandas Series is like a column in a table.
    It is a one-dimensional array holding data of any type.

In [61]:
l4 = [2,6,3,6,4,5,2,8,4,5,7]

In [72]:
ss =pd.Series(l4,)

In [73]:
ss

0     2
1     6
2     3
3     6
4     4
5     5
6     2
7     8
8     4
9     5
10    7
dtype: int64